using LegalFramework.Services.NumbersToWords;

using NUnit.Framework;


namespace Payroll.Services.Test
{
	[TestFixture]
	internal class TestConvertNumbersToWordsBG : ConvertingNumberToWordsBG
	{
		[TestCaseSource( nameof( TestParameters_WriteNumberInWords_ResultTypeCurrency ) )]
		public void Method_WriteNumberInWords_ReturnCurrency
												( decimal number, string cultureName, string result )
		{
			string? numberInWords = this.WriteNumberInWords( number, SupportConstants.Currency, cultureName );

			Assert.That( numberInWords, Is.EqualTo( result ) );
		}

		[TestCaseSource( nameof( TestParametersBG_WriteNumberInWords_ResultTypeNumber ) )]
		public void Method_WriteNumberInWordsBG_ReturnRegularNumberInWords
											( decimal number, string result )
		{
			string? numberInWords = this.WriteNumberInWords( number );

			Assert.That( numberInWords, Is.EqualTo( result ) );
		}

		//###################################################################################3

		public static object[] TestParametersBG_WriteNumberInWords_ResultTypeNumber =
		{
			new object[] {0.1m,"нула цяло и една десета"},
			new object[] {1.1m,"едно цяло и една десета"},
			new object[] {9.01m,"девет цяло и една стотна"},
			new object[] {10.001m,"десет цяло и една хилядна"},
			new object[] {11.0001m,"единадесет цяло и една десетохилядна"},
			new object[] {19.2000m,"деветнадесет цяло и две десети"},
			new object[] {20.0200m,"двадесет цяло и две стотни"},
			new object[] {90.0020m,"деветдесет цяло и две хилядни"},
			new object[] {99.12m,"деветдесет и девет цяло и дванадесет стотни"},
			new object[] {100.19m,"сто цяло и деветнадесет стотни"},
			new object[] {101.22m,"сто и едно цяло и двадесет и две стотни"},
			new object[] {112.101m,"сто и дванадесет цяло и сто и една хилядни"},
			new object[] {999.099m,"деветстотин деветдесет и девет цяло и деветдесет и девет хилядни"},
			new object[] {1000.199m,"хиляда цяло и сто деветдесет и девет хилядни"},
			new object[] {10_000.1001m,"десет хиляди цяло и хиляда и една десетохилядни"},
			new object[] {19_100.1101m,"деветнадесет хиляди и сто цяло и хиляда сто и една десетохилядни"},
			new object[] {31_001.991234567m,"тридесет и едно хиляди и едно цяло и "
										  + "девет хиляди деветстотин и дванадесет десетохилядни"},
			new object[] {101_001.9999555554444m,"сто и едно хиляди и две"},
			new object[] {1_881_100.09994444m,"един милион осемстотин осемдесет и едно "
											 + "хиляди и сто цяло и деветстотин деветдесет и девет "
											 + "десетохилядни"},
			new object[] {1_001_100.20m,"един милион хиляда и сто цяло и две десети" },
			new object[] {1_000_005.56m,"един милион и пет цяло и петдесет и шест стотни" },
			new object[] {2_000_010.56m,"два милиона и десет цяло и петдесет и шест стотни" },
			new object[] {2_000_200.56m,"два милиона и двеста цяло и петдесет и шест стотни" },
			new object[] {2_000_205.56m,"два милиона двеста и пет цяло и петдесет и шест стотни" },
			new object[] {2_000_333.56m,"два милиона триста тридесет и три цяло "
									  + "и петдесет и шест стотни" },
			new object[] {2_005_000.56m,"два милиона и пет хиляди цяло и петдесет и шест стотни" },
			new object[] {2_005_001.56m,"два милиона пет хиляди и едно цяло и петдесет и шест стотни" },
			new object[] {2_005_011.56m,"два милиона пет хиляди и единадесет цяло "
									  + "и петдесет и шест стотни" },
			new object[] {2_001_020.56m,"два милиона хиляда и двадесет цяло и петдесет и шест стотни" },
			new object[] {2_019_020.56m,"два милиона деветнадесет хиляди и двадесет цяло "
									  + "и петдесет и шест стотни" },
			new object[] {2_019_021.56m,"два милиона деветнадесет хиляди двадесет и едно цяло "
									  + "и петдесет и шест стотни" },
			new object[] {2_019_000.56m,"два милиона и деветнадесет хиляди цяло "
									  + "и петдесет и шест стотни" },
			new object[] {1_021_000.56m,"един милион двадесет и едно хиляди цяло "
									  + "и петдесет и шест стотни" },
			new object[] {12_091_000.5m,"дванадесет милиона деветдесет и едно хиляди цяло и пет десети"},
			new object[] {1_030_000.56m,"един милион и тридесет хиляди цяло "
									  + "и петдесет и шест стотни" },
			new object[] {1_030_002.56m,"един милион тридесет хиляди и две цяло "
									  + "и петдесет и шест стотни" },
			new object[] {1_100_000.56m,"един милион и сто хиляди цяло "
									  + "и петдесет и шест стотни" },
			new object[] {1_100_100.56m,"един милион сто хиляди и сто цяло "
									  + "и петдесет и шест стотни" },
			new object[] {1_000_100_100.56m,"един милиард сто хиляди и сто цяло "
									  + "и петдесет и шест стотни" },

			new object[] {2_002_000_002.56m,"два милиарда два милиона и две цяло "
									  + "и петдесет и шест стотни" },
		};

		public static object[] TestParameters_WriteNumberInWords_ResultTypeCurrency =
		{
			new object[] { 1.89999999999m,  "bg-BG", "един лв. и 90 ст."},
			new object[] { 2.89999999999m,  "bg-BG", "два лв. и 90 ст."},
			new object[] { 9.01m, "bg-BG", "девет лв. и 01 ст."},
			new object[] { 10m, "bg-BG", "десет лв."},
			new object[] {11.010008888m, "bg-BG", "единадесет лв. и 01 ст." },
			new object[] {19.109999999m, "bg-BG", "деветнадесет лв. и 11 ст." },
			new object[] {20.99999998888m, "bg-BG", "двадесет и един лв."},
			new object[] {99.92457789m, "bg-BG", "деветдесет и девет лв. и 92 ст."},
			new object[] {99.999999994447m, "bg-BG", "сто лв."},
			new object[] {32.009999999m, "bg-BG", "тридесет и два лв. и 01 ст."},
			new object[] {41.009999999m, "bg-BG", "четиридесет и един лв. и 01 ст."},
			new object[] {999.999888888m,"bg-BG", "хиляда лв."},
			new object[] {9999.9995555555m,"bg-BG", "десет хиляди лв."},
			new object[] {100_100.09678m, "bg-BG", "сто хиляди и сто лв. и 10 ст."},
			new object[] {110_000.9997777m,"bg-BG", "сто и десет хиляди и един лв."},
			new object[] {111_000.774444m,"bg-BG", "сто и единадесет хиляди лв. и 77 ст."},
			new object[] {121_000.774444m,"bg-BG", "сто двадесет и един хиляди лв. и 77 ст."},
			new object[] {162_000.774444m,"bg-BG", "сто шестдесет и два хиляди лв. и 77 ст."},
			new object[] {1_881_100.09994444m,"bg-BG","един милион осемстотин осемдесет и един "
											 + "хиляди и сто лв. и 10 ст."},
			new object[] {1_001_100.20m,"bg-BG","един милион хиляда и сто лв. и 20 ст." },
			new object[] {1_000_005.56m,"bg-BG","един милион и пет лв. и 56 ст." },
			new object[] {2_000_010.56m,"bg-BG","два милиона и десет лв. и 56 ст." },
			new object[] {2_000_200.56m,"bg-BG","два милиона и двеста лв. и 56 ст." },
			new object[] {2_000_205.56m,"bg-BG","два милиона двеста и пет лв. и 56 ст." },
			new object[] {2_000_333.56m,"bg-BG","два милиона триста тридесет и три лв. и 56 ст." },
			new object[] {2_005_000.56m,"bg-BG","два милиона и пет хиляди лв. и 56 ст." },
			new object[] {2_005_001.56m,"bg-BG","два милиона пет хиляди и един лв. и 56 ст." },
			new object[] {2_005_011.56m,"bg-BG","два милиона пет хиляди и единадесет лв. и 56 ст." },
			new object[] {2_001_020.56m,"bg-BG","два милиона хиляда и двадесет лв. и 56 ст." },
			new object[] {2_019_020.56m,"bg-BG","два милиона деветнадесет хиляди и двадесет лв. и 56 ст." },
			new object[] {2_019_021.56m,"bg-BG","два милиона деветнадесет хиляди двадесет и един лв."
											  + " и 56 ст." },
			new object[] {2_019_000.56m,"bg-BG","два милиона и деветнадесет хиляди лв. и 56 ст." },
			new object[] {1_021_000.56m,"bg-BG", "един милион двадесет и един хиляди лв. и 56 ст." },
			new object[] {12_091_000.56m,"bg-BG", "дванадесет милиона деветдесет и един хиляди лв. и 56 ст." },
			new object[] {1_030_000.56m,"bg-BG","един милион и тридесет хиляди лв. и 56 ст." },
			new object[] {1_030_002.56m,"bg-BG","един милион тридесет хиляди и два лв. и 56 ст." },
			new object[] {1_100_000.56m,"bg-BG","един милион и сто хиляди лв. и 56 ст." },
			new object[] {1_100_100.56m,"bg-BG","един милион сто хиляди и сто лв. и 56 ст." },
			new object[] {1_000_100_100.56m,"bg-BG","един милиард сто хиляди и сто лв. и 56 ст." },
			new object[] {2_002_000_002.56m,"bg-BG", "два милиарда два милиона и два лв. и 56 ст." },
		};
	}
}
